{"resourceType":"CodeSystem","id":"ecb37539-ddfd-4fe0-a3d6-f152f1bc2bd0","url":"https://fhir.nhs.uk/CodeSystem/EPS-task-prescription-release-rejection-reason","identifier":[{"system":"https://fhir.nhs.uk/identifier/CodeSystem","value":"EPS-task-prescription-release-rejection-reason"}],"version":"16.34","name":"EPSPrescriptionReleaseRejectionReason","title":"EPS Prescription Release Rejection Reason","status":"draft","experimental":false,"date":"2005-06-17","publisher":"NHS Digital","contact":[{"name":"Interoperability Team","telecom":[{"system":"email","value":"interoperabilityteam@nhs.net","use":"work"}]}],"description":"EPS Prescription Release Rejection Reason","caseSensitive":true,"content":"complete","concept":[{"code":"0001","display":"Prescription has been cancelled","definition":"Inform the dispenser to advise the patient that their prescription has been cancelled"},{"code":"0002","display":"Prescription has expired","definition":"Inform the dispenser that the prescription has expired and it cannot be downloaded"},{"code":"0003","display":"Prescription cannot be found – contact your GP/prescriber","definition":"Contact prescriber Inform the dispenser that the prescription not be found. This may be because;          1. There is no matching prescription.          2. The prescription has been removed from the ETP component under the ETP housekeeping rules. In such cases, there has been a considerable time period between this request and the receipt of the prescription.          3. The prescription has not arrived at the Spine. This may occur if the prescription is requested immediately after the prescriber has submitted it, or is a post-dated prescription."},{"code":"0004","display":"Prescription is with another dispenser","definition":"Inform the dispenser that the prescription has been downloaded by another dispenser. The rejection message will contain details of the dispensing site that has the prescription."},{"code":"0005","display":"Prescription has been dispensed","definition":"Inform the dispenser to advise the patient that this prescription has already been dispensed."},{"code":"0006","display":"No more nominated prescriptions available","definition":"No further request messages to pull down nominated prescriptions should be submitted at this time"},{"code":"0007","display":"Nominated download functionality disabled in spine","definition":"The Spine nomination functionality has been disabled at the request of the Authority and the message is rejected. The request will not be processed. However, the prescription request by prescription unique identifier should be available."},{"code":"0099","display":"Incompatible version of Request. [Additional Information (if any)]","definition":"The user should inform their system supplier that an incompatible version of a prescription has been received. This scenario may occur when a new version of the EPS is deployed but any messaging incompatibles will be carefully managed by the EPS Programme."},{"code":"5000","display":"Unable to process message. [Additional Information (if any)]","definition":"The user should inform their system supplier that a request message was rejected by the Spine."},{"code":"5888","display":"Invalid message","definition":"The user should inform their system supplier that a message was rejected as invalid by the Spine."},{"code":"9006","display":"Format of date passed is invalid","definition":"The format of a date/time attribute with the prescription does not conform with the format defined within the MIM. The System shall correct the date/time attribute and re-submit the prescription to the Spine."}]}